Ran Plan for 2 projects:

1. dir: `terraform/EC2-Instance` workspace: `default`
1. dir: `terraform/EC2-Instance/module/security` workspace: `default`

### 1. dir: `terraform/EC2-Instance` workspace: `default`
**Plan Error**
```
running "/usr/bin/terraform plan -input=false -refresh -out \"/home/klept/.atlantis/repos/klept-lab/demo-with-klept/15/default/terraform/EC2-Instance/default.tfplan\"" in "/home/klept/.atlantis/repos/klept-lab/demo-with-klept/15/default/terraform/EC2-Instance": exit status 1
Acquiring state lock. This may take a few moments...
╷
│ Error: Reference to undeclared module
│ 
│   on main.tf line 7, in module "compute":
│    7:   sg            = module.security.demo_app_sg
│ 
│ No module call named "security" is declared in the root module.
╵

```

---
### 2. dir: `terraform/EC2-Instance/module/security` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_security_group.demo-app-sg will be created
+ resource "aws_security_group" "demo-app-sg" {
      + arn                    = (known after apply)
      + description            = "Allow SSH and Node-Exporter Traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "152.32.100.47/32",
                ]
              + description      = "Allow incoming traffic on port 9100 from HOME"
              + from_port        = 9100
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 9100
            },
          + {
              + cidr_blocks      = [
                  + "152.32.100.47/32",
                ]
              + description      = "Allow ssh from HOME"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "74.48.95.53/32",
                ]
              + description      = "Allow incoming traffic on port 9100 from VPS"
              + from_port        = 9100
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 9100
            },
        ]
      + name                   = "Security Group for TestAppServerInstance"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "demo-app"
        }
      + tags_all               = {
          + "Name" = "demo-app"
        }
      + vpc_id                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ demo_app_sg = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/EC2-Instance/module/security`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.demo-with-klept.online/lock?id=klept-lab%252Fdemo-with-klept%252Fterraform%252FEC2-Instance%252Fmodule%252Fsecurity%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/EC2-Instance/module/security`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
